Repository: pingfangx/TranslatorX-other
Catalog: AndroidDocs/omegat/project_save.tmx
Source language: en_us
Languages: zh_cn

source: A View that displays web pages.
zh_cn: 显示网页的 view。

source: A View that is bound to the given position or NULL if there is no View to re-use
zh_cn: 绑定到给定位置的 view，如果没有可重用的 view，则为 NULL

source: A ViewHolder describes an item view and metadata about its place within the RecyclerView.
zh_cn: ViewHolder 描述了在 RecyclerView 中的一个 item view 以及它所在位置的元数据。

source: A ViewStub is an invisible, zero-sized View that can be used to lazily inflate layout resources at runtime.
zh_cn: ViewStub 是一个不可见的零大小的 View，可用于在运行时延迟加载布局资源。

source: A ViewSwitcher can only have two child views, of which only one is shown at a time.
zh_cn: ViewSwitcher 只能有两个子 view，其中一次只显示一个。

source: A WebView is useful when you need increased control over the UI and advanced configuration options that will allow you to embed web pages in a specially-designed environment for your app.
zh_cn: 当你需要增加对 UI 和高级配置选项的控制时，WebView 非常有用，这些选项允许你在专门设计的应用环境中嵌入网页。

source: A bitmap configuration describes how pixels are stored.
zh_cn: 描述像素如何存储的位图配置。

source: A boolean value defined in XML.
zh_cn: 以 XML 定义的布尔值。

source: A button with two states, checked and unchecked.
zh_cn: 具有两种状态的按钮，已选中和未选中。

source: A callback interface that can be used to alter the drawing order of RecyclerView children.
zh_cn: 改变 RecyclerView 子控件的绘制顺序的回调接口。

source: A callback that notifies clients when the progress level has been changed.
zh_cn: 在进度级别更改时通知客户端的回调。

source: A callback that notifies clients when the rating has been changed.
zh_cn: 在评级已更改时通知客户端的回调。

source: A callback that notifies when the chronometer has incremented on its own.
zh_cn: 一个回调，通知计时器何时自行递增。

source: A chain allows you to distribute a group of views horizontally or vertically with the following styles (as shown in figure 14):
zh_cn: 链允许你使用以下样式水平或垂直分发一组 view(如图 14 所示)：

source: A chain is a group of views that are linked to each other with bi-directional position constraints.
zh_cn: 链是用双向位置约束彼此链接的一组 view。

source: A chain works properly only if each end of the chain is constrained to another object on the same axis, as shown in figure 13.
zh_cn: 只有链的每一端都被约束到同一轴上的另一个对象，链才能正常工作，如图 13 所示。

source: A checkbox is a specific type of two-states button that can be either checked or unchecked.
zh_cn: 复选框是特定类型的双状态按钮，可以选中也可以取消选中。

source: A child that is often used is a LinearLayout in a horizontal orientation, presenting a horizontal array of top-level items that the user can scroll through.
zh_cn: 经常使用的子项是水平方向的 LinearLayout，呈现用户可以滚动的顶级项目的水平数组。

source: A child view that has entered into a temporarily detached state during layout.
zh_cn: 在布局过程中，一个进入暂时分离状态的子 view。

source: A child view that must be rebound by the adapter before being displayed.
zh_cn: 一个子 view，它在显示之前必须由 adapter 重新绑定。

source: A class for converting encoded images (like PNG, JPEG, WEBP, GIF, or HEIF) into Drawable or Bitmap objects.
zh_cn: 用于将编码图像(如 PNG，JPEG，WEBP，GIF 或 HEIF) 转为 Drawable 或 Bitmap 对象的类。

source: A class that creates a Material Themed CheckBox.
zh_cn: 创建材质主题复选框的类。

source: A class that creates a Material Themed RadioButton.
zh_cn: 创建以材质为主题的单选按钮的类。

source: A class that creates a Material Themed Switch.
zh_cn: 创建材质主题的开关类。

source: A class that represents a fixed view in a list, for example a header at the top or a footer at the bottom.
zh_cn: 表示列表中固定 view 的类，例如顶部的 header 或底部的 footer。

source: A cold start refers to an app’s starting from scratch: the system’s process has not, until this start, created the app’s process.
zh_cn: 冷启动是指应用程序从头开始：系统的进程在此开始之前没有创建应用程序的进程。

source: A color to apply to the subtitle string.
zh_cn: 应用于副标题字符串的颜色。

source: A color to apply to the title string.
zh_cn: 要应用于标题字符串的颜色。

source: A color value defined in XML.
zh_cn: 在 XML 中定义的颜色值。

source: A common container for a set of related, toggleable MaterialButtons.
zh_cn: 一组相关的可切换 MaterialButton 的公共容器。

source: A common example would be in an e-book reader, where tapping on the screen brings back whatever screen and UI decorations that had been hidden while the user was immersed in reading the book.
zh_cn: 一个常见的例子是在电子书阅读器中，点击屏幕会带回用户沉浸在阅读书籍时隐藏的任​​何屏幕和 UI 装饰。

source: A common pattern is to:
zh_cn: 一个常见的模式：

source: A common way to implement a themed launch screen is to use the windowDisablePreview theme attribute to turn off the initial blank screen that the system process draws when launching the app.
zh_cn: 实现主题启动屏幕的常用方法是使用 windowDisablePreview 主题属性来关闭启动应用程序时系统进程绘制的初始空白屏幕。

source: A compiled representation of a regular expression.
zh_cn: 正则表达式的编译表示。

source: A content URI allows you to grant read and write access using temporary access permissions.
zh_cn: content URI 允许你使用临时访问权限授予读写访问权限。

source: A content description string to describe the appearance of the associated logo image.
zh_cn: 用于描述相关徽标图像外观的内容描述字符串。

source: A convenience class for creating a new Material button.
zh_cn: 用于创建新“材质”按钮的便捷类。

source: A dialog appears, asking if you would like to convert the image to PNG, deleting the original WebP file, or keep the original WebP file as well as the new PNG file.
zh_cn: 将出现一个对话框，询问你是要将图像转换为 PNG，删除原始 WebP 文件，还是保留原始 WebP 文件以及新的 PNG 文件。

source: A dimension is specified with a number followed by a unit of measure.
zh_cn: 尺寸由数字后跟度量单位来指定。

source: A dimension value defined in XML.
zh_cn: XML 中定义的尺寸值。

source: A dimension, represented by a float, followed by a unit of measurement (dp, sp, pt, px, mm, in), as described above.
zh_cn: 如上所述，由浮点表示的尺寸，接着是测量单位(dp，sp，pt，px，mm，in)。

source: A disabled view that is clickable still consumes the touch events, it just doesn't respond to them.
zh_cn: 可点击的禁用 view 仍然会消耗触摸事件，只是没有响应。

source: A drawable to use as the background.
zh_cn: 一个 drawable 用作背景。

source: A example usage of a checkbox inside your activity would be the following:
zh_cn: activity 中复选框的示例用法如下：

source: A few other things to consider when using chains:
zh_cn: 使用链时要考虑的其他几件事：

source: A flexible view for providing a limited window into a large data set.
zh_cn: 参考： 韩曙亮.【Android 应用开发】RecycleView API 翻译 (文档翻译).http://blog.csdn.net/shulianghan/article/details/53514689 一个灵活的 view，使用它可以让一个有限的窗口显示一个大数据集。

source: A full reference to the kind of restrictions these specifications can require can be found in the reference documentation under View.onMeasure(int, int) (this reference documentation does a pretty good job of explaining the whole measurement operation as well).
zh_cn: 有关这种规格需要的限制的完整参考，可以在 View.onMeasure(int, int) 的参考文档中找到（这个参考也很好的解释了整个测量的操作）。

source: A full-bleed scrim which is show or hidden when the scroll position has hit a certain threshold.
zh_cn: 当滚动位置达到某个阈值时显示或隐藏的 full-bleed scrim。

source: A good example of this is the fling gesture, where the user quickly moves a finger across the screen and then lifts it.
zh_cn: 一个很好的例子是 fling 手势，用户可以快速地在屏幕上移动手指，然后将其抬起。

source: A good rule to follow is to always expose any property that affects the visible appearance or behavior of your custom view.
zh_cn: 要遵循的一个好规则是始终公开任何影响自定义 view 的可见外观或行为的属性。

source: A good way to look for bottlenecks is to use the Android Studio CPU Profiler.
zh_cn: 寻找瓶颈的好方法是使用 Android Studio CPU Profiler。

source: A grid with N columns has N + 1 grid indices that run from 0 through N inclusive.
zh_cn: 具有 N 列的网格具有 N + 1 个网格索引，其从 0 到 N(包括端点)。

source: A helper class to provide the number of spans each item occupies.
zh_cn: 一个助手类，它可以提供每个 item 占据的 span 数量。

source: A hot start displays the same on-screen behavior as a cold start scenario: The system process displays a blank screen until the app has finished rendering the activity.
zh_cn: 热启动与冷启动方案有相同的屏幕显示行为：系统进程显示空白屏幕，直到应用程序完成渲染 activity。

source: A hot start of your application is much simpler and lower-overhead than a cold start.
zh_cn: 应用程序的热启动比冷启动更简单，开销更低。

source: A layout that arranges its children horizontally.
zh_cn: 一种水平排列其子项的布局。

source: A layout that arranges its children into rows and columns.
zh_cn: 将子项排列为行和列的布局。

source: A layout that arranges other views either horizontally in a single column or vertically in a single row.
zh_cn: 一种布局，可以在单列中水平排列其他 view，也可以在单行中垂直排列其他 view。

source: A layout that lets you specify exact locations (x/y coordinates) of its children.
zh_cn: 一种布局，可让你指定其子项的精确位置(x/y 坐标)。

source: A layout that places its children in a rectangular
zh_cn: 布局，将其子级放置在矩形

source: A layout that places its children in a rectangular grid.
zh_cn: 将子项放在矩形 grid (网格) 中的布局。

source: A left (or first) pane is treated as a content list or browser, subordinate to a primary detail view for displaying content.
zh_cn: 左(或第一)窗格被视为内容列表或浏览器，从属于用于显示内容的主要详细 view。

source: A list does not have a spatial definition here.
zh_cn: 列表在此处没有空间定义。

source: A list view is an adapter view that does not know the details, such as type and contents, of the views it contains.
zh_cn: 列表 view 是 adapter view，它不知道它包含的 view 的详细信息，例如类型和内容。

source: A loss of network connectivity that has consequences within an app should be logged at the DEBUG or VERBOSE level (depending on whether the consequences are serious enough and unexpected enough to be logged in a release build).
zh_cn: 如果失去网络连接后导致在应用内出现某种后果，则应该记录为 DEBUG 或 VERBOSE 级别(具体取决于后果是否足够严重以及足够意外，足以记录在发布版本中)。

source: A lot of physics and math are required to get a flywheel model working correctly.
zh_cn: 需要大量的物理和数学才能使飞轮模型正常工作。

source: A matcher finds matches in a subset of its input called the region.
zh_cn: 匹配器在其输入的子集（称为 region ）中查找匹配项。

source: A matcher is created from a pattern by invoking the pattern's matcher method.
zh_cn: 通过调用 pattern 的 matcher 方法从 pattern 创建匹配器。

source: A matcher may be reset explicitly by invoking its reset() method or, if a new input sequence is desired, its reset(CharSequence) method.
zh_cn: 可以通过调用匹配器的 reset() 方法来显式重置匹配器，如果需要新输入序列，则调用其 reset(CharSequence) 方法。

source: A more sophisticated component may override even more on... methods and introduce some of its own helper methods, substantially customizing its properties and behavior.
zh_cn: 一个更复杂的组件可以重写更多的 on... 方法，并引入一些自己的助手方法，充分地自定义自己的属性和行为。

source: A name for the dimension.
zh_cn: 尺寸的名称。

source: A new ViewHolder that holds a View of the given view type.
zh_cn: 持有给定 view 类型的 View 的新 ViewHolder。

source: A non-null list of merged payloads.
zh_cn: 合并的有效载荷的非空列表。

source: A notifyItemRangeChanged() with null payload will clear all existing payloads on that item and prevent future payload until #onBindViewHolder(ViewHolder, int, List) is called.
zh_cn: 一个空有效载荷的 notifyItemRangeChanged() 将清除该项上所有现有的有效载荷，并防止未来的有效载荷，直到调用 #onBindViewHolder(ViewHolder, int, List) 。

source: A parent view may call measure() more than once on its children.
zh_cn: 一个父 view 可能在子 view 上多次调用 measure() 方法。

source: A partial list of available widgets includes Button, TextView, EditText, ListView, CheckBox, RadioButton, Gallery, Spinner, and the more special-purpose AutoCompleteTextView, ImageSwitcher, and TextSwitcher.
zh_cn: 部分可用的控件列表包括 Button, TextView, EditText, ListView, CheckBox, RadioButton, Gallery, Spinner，以及更多特殊目的的控件如 AutoCompleteTextView, ImageSwitcher,TextSwitcher 等。

source: A primary toolbar within the activity that may display the activity title, application-level navigation affordances, and other interactive items.
zh_cn: activity 中的主工具栏，可显示 activity 标题，应用程序级导航功能和其他交互项。

source: A radio button is a two-states button that can be either checked or unchecked.
zh_cn: 单选按钮是一个双状态按钮，可以选中或取消选中。

source: A scrim may be used to indicate that the other elements beneath it are not currently interactive or actionable, drawing user focus and attention to the views above the scrim.
zh_cn: 可以使用稀松布来指示其下面的其他元素当前不是交互式的或可操作的，从而将用户焦点和注意力吸引到稀松布上方的 view。

source: A scrim which is shown or hidden behind the status bar when the scroll position has hit a certain threshold.
zh_cn: 当滚动位置达到某个阈值时，在状态栏后面显示或隐藏的 scrim。

source: A short distance may cause much more perspective distortion upon rotation, and can also result in some drawing artifacts if the rotated view ends up partially behind the camera (which is why the recommendation is to use a distance at least as far as the size of the view, if the view is to be rotated.)
zh_cn: 短距离可能会在旋转时造成更多的透视畸变，并且如果旋转的 view 最终有一部分地在相机后面，也可能导致一些绘制瑕疵（这就是为什么在旋转 view 时，建议使用至少为 view 的尺寸作为相机距离。）

source: A single enum can add about 1.0 to 1.4 KB of size to your app's classes.dex file.
zh_cn: 单个枚举可以为应用程序的 classes.dex 文件添加大约 1.0 到 1.4 KB 的大小。

source: A small exception to this rule is when the view does not have an animator reference but transient state is true (due to animations created outside ItemAnimator).
zh_cn: 此规则的一个小例外是，view 没有 animator 引用，但 transient 状态为 true (由于在 ItemAnimator 外部创建的动画)。

source: A special sub-class of EditText designed for use as a child of TextInputLayout.
zh_cn: 一个特殊的 EditText 子类，设计用作 TextInputLayout 的子元素。

source: A special widget composed of two children views: the handle, that the users drags, and the content, attached to the handle and dragged with it.
zh_cn: 一个由两个子 view 组成的特殊小部件：用户拖动的句柄，以及附加到句柄并随之拖动的内容。

source: A standard toolbar for use within application content.
zh_cn: 用于应用程序内容的标准工具栏。

source: A string resource containing the full class name is available.
zh_cn: 可以使用包含完整类名的字符串资源。

source: A subclass of RecyclerView.Adapter responsible for providing views that represent items in a data set.
zh_cn: RecyclerView.Adapter 的子类，负责提供 view 用以展示数据集中的数据项。

source: A subclass of ConstraintLayout for building animations.
zh_cn: 用于构建动画的 ConstraintLayout 的子类。

source: A subclass of Shader is installed in a Paint calling paint.setShader(shader).
zh_cn: Shader 的子类在调用 paint.setShader(shader) 时被安装到 Paint 中。

source: A subclass of Shader that draws a sweep gradient around a center point.
zh_cn: Shader 的一个子类，它围绕中心点绘制一个渐变扫区。

source: A subclass of shader that returns the composition of two other shaders, combined by an Xfermode subclass.
zh_cn: 组合着色器，着色器的一个子类，它返回两个其他着色器的组合，由 Xfermode 的子类组合。

source: A subclass overrides the finalize method to dispose of system resources or to perform other cleanup.
zh_cn: 子类会覆盖 finalize 方法来处理系统资源或执行其他清理。

source: A tab has a tab indicator, content, and a tag that is used to keep track of it.
zh_cn: 选项卡具有选项卡指示符，内容和用于跟踪它的标记。

source: A tab in this layout.
zh_cn: 此布局中的选项卡。

source: A table can leave cells empty.
zh_cn: 表格可以将单元格留空。

source: A task (from the activity that started it to the next task activity) defines an atomic group of activities that the user can move to.
zh_cn: 任务(从启动它的 activity 到下一个任务 activity)定义了用户可以移动到的 activity 的原子组。

source: A title which is larger when the layout is fully visible but collapses and becomes smaller as the layout is scrolled off screen.
zh_cn: 标题在布局完全可见时较大，但随着布局在屏幕上滚动会折叠并变小。

source: A transparent overlay for gesture input that can be placed on top of other widgets or contain other widgets.
zh_cn: 用于手势输入的透明覆盖，可以放置在其他小部件之上或包含其他小部件。

source: A unique resource ID defined in XML.
zh_cn: XML 中定义的唯一资源 ID。

source: A useful aspect of ConstraintLayout is in how it deals with "impossible" constrains.
zh_cn: ConstraintLayout 一个有用的方面是如何处理 "不可能" 的约束。

source: A user interface element for entering and modifying text.
zh_cn: 用于输入和修改文本的用户界面元素。

source: A user interface element that displays text to the user.
zh_cn: 用户界面元素，向用户显示文本。

source: A user interface element that indicates the progress of an operation.
zh_cn: 用于指示操作进度的用户界面元素。

source: A user interface element the user can tap or click to perform an action.
zh_cn: 用户可以点击或单击以执行操作的用户界面元素。

source: A value of 0.0 indicates no movement at all, 1.0f indicates normal scroll movement.
zh_cn: 值 0.0 表示根本没有移动，1.0f 表示正常滚动的移动。

source: A view actually possess two pairs of width and height values.
zh_cn: 一个 view 实际上控制两对宽高值。

source: A view can be a part of both a horizontal and a vertical chain, making it easy to build flexible grid layouts.
zh_cn: view 可以是水平和垂直链的一部分，使得构建灵活的网格布局变得容易。

source: A view containing controls for a MediaPlayer.
zh_cn: 包含 MediaPlayer 控件的 view。

source: A view group that allows the view hierarchy placed within it to be scrolled.
zh_cn: 一个 view group，允许滚动放置在其中的 view 层次结构。

source: A view group with two children, intended for use in ListViews.
zh_cn: 一个包含两个子节点的 view 组，用于 ListView。

source: A view has a location, expressed as a pair of left and top coordinates, and two dimensions, expressed as a width and a height.
zh_cn: view 有一个位置，表示为一对 left 和 top 坐标，以及两个尺寸，表示为宽和高。

source: A view is recycled when a LayoutManager decides that it no longer needs to be attached to its parent RecyclerView.
zh_cn: 当 LayoutManager 决定不再需要将 view 附加到其父级 RecyclerView 时，view 将被回收。

source: A view must be fully detached (removed from parent) before it may be recycled.
zh_cn: view 必须完全分离(从父 view 中移除)，然后才能回收。

source: A view previously used to display data for a specific adapter position may be placed in a cache for later reuse to display the same type of data again later.
zh_cn: 一个 view 之前用于显示 adapter 中某个位置的数据，它可能会被放到缓存中，以便于之后再次使用用于显示相同类型的数据。

source: A view that displays one child at a time and lets the user pick among them.
zh_cn: 一次显示一个子项并让用户在其中进行选择的 view。

source: A view that renders a virtual Keyboard.
zh_cn: 呈现虚拟 Keyboard 的 view。

source: A view that shows items in a center-locked, horizontally scrolling list.
zh_cn: 一个 view，显示中心锁定的水平滚动列表中的项目。

source: A view that shows items in a vertically scrolling two-level list.
zh_cn: 一个 view，显示垂直滚动的两级列表中的项目。

source: A view that shows items in two-dimensional scrolling grid.
zh_cn: 在二维滚动网格中显示项目的 view。

source: A view's measured width and measured height values must respect the constraints imposed by the view's parents.
zh_cn: view 的测量宽度和测量高度值必须遵守 view 父项施加的约束。

source: A warm start encompasses some subset of the operations that take place during a cold start; at the same time, it represents less overhead than a hot start.
zh_cn: 温启动包括冷启动期间发生的一些操作子集;同时，它表示比热启动更少的开销。

source: A well-designed custom view is much like any other well-designed class.
zh_cn: 精心设计的自定义 view 与任何其他精心设计的类非常相似。

source: A widget for selecting the time of day, in either 24-hour or AM/PM mode.
zh_cn: 用于在 24 小时或 AM/PM 模式下选择时间的小部件。

source: A widget that enables the user to select a number from a predefined range.
zh_cn: 一个小部件，使用户可以从预定义的范围中选择一个数字。

source: A widget that provides a user interface for the user to enter a search query and submit a request to a search provider.
zh_cn: 一个小部件，为用户提供用户界面以输入搜索查询并向搜索提供程序提交请求。

source: AT_MOST: This is used by the parent to impose a maximum size on the child.
zh_cn: AT_MOST：用于父 view 强加给子 view 一个最大值。

source: AbsListView extends LayoutParams to provide a place to hold the view type.
zh_cn: AbsListView 扩展 LayoutParams 以提供保存 view 类型的位置。

source: AbsSeekBar extends the capabilities of ProgressBar by adding a draggable thumb.
zh_cn: AbsSeekBar 通过添加可拖动的 thumb 来扩展 ProgressBar 的功能。

source: Absolute layouts are less flexible and harder to maintain than other types of layouts without absolute positioning.
zh_cn: 与没有绝对定位的其他类型的布局相比，绝对布局不够灵活且难以维护。

source: Acceptable alternatives (in order of preference) are:
zh_cn: 可接受的替代方案(按优先顺序排列)包括：

source: Accepts a user-provided Renderer object that does the actual rendering.
zh_cn: 接受用户提供的 Renderer 对象，该对象执行实际渲染。

source: Accepts the following URI schemes:
zh_cn: 接受以下 URI 方案：

source: Access to the underlying surface is provided via the SurfaceHolder interface, which can be retrieved by calling getHolder().
zh_cn: 通过 SurfaceHolder 接口提供对底层 surface 的访问，可以通过调用 getHolder() 来获取。

source: Action bar navigation modes are deprecated and not supported by inline toolbar action bars.
zh_cn: 不建议使用操作栏导航模式，内联工具栏操作栏不支持。

source: Action buttons are vertically aligned within the Toolbar's minimum height, if set.
zh_cn: 如果设置，操作按钮在工具栏的 minimum height 内垂直对齐。

source: ActionMenuView is a presentation of a series of menu options as a View.
zh_cn: actionMenuView 是一系列菜单选项的 view 表示。

source: Activities that use this feature should use one of the supplied .NoActionBar themes, set the windowActionBar attribute to false or otherwise not request the window feature.
zh_cn: 使用此功能的 activity 应使用提供的 .NoActionBar 主题之一，将 windowActionBar 属性设置为 false 或不请求窗口功能。

source: Activity creation
zh_cn: Activity 创建

source: Activity creation often entails a lot of high-overhead work.
zh_cn: 创建 activity 通常需要大量高额开销。

source: Adapter position to query
zh_cn: 要查询的适配器位置

source: Adapter should not assume that the payload passed in notify methods will be received by onBindViewHolder().
zh_cn: 适配器不应假定 onBindViewHolder() 将接收传入 notify 方法的 payload。

source: Adapter should not assume that the payload will always be passed to onBindViewHolder(), e.g. when the view is not attached, the payload will be simply dropped.
zh_cn: 适配器不应假定有效负载将始终传递给 onBindViewHolder()，例如，当未附加 view 时，有效负载将被简单地丢弃。

source: Adapters provide a binding from an app-specific data set to views that are displayed within a RecyclerView.
zh_cn: 适配器提供了绑定功能，可以将应用相关的数据集，绑定到展示在 RecyclerView 中的 view。

source: Add ConstraintLayout to your project
zh_cn: 添加 ConstraintLayout 到我们的项目中

source: Add Properties and Events
zh_cn: 添加属性和事件

source: Add a closed circle contour to the path
zh_cn: 在路径中添加闭合圆形轮廓

source: Add a closed oval contour to the path
zh_cn: 在路径中添加封闭的椭圆形轮廓

source: Add a closed rectangle contour to the path
zh_cn: 在路径中添加闭合的矩形轮廓

source: Add a closed round-rectangle contour to the path
zh_cn: 在路径中添加一个封闭的圆角矩形轮廓

source: Add a closed round-rectangle contour to the path.
zh_cn: 在路径中添加一个封闭的圆角矩形轮廓。

source: Add a constraint
zh_cn: 添加约束

source: Add a copy of src to the path
zh_cn: 将 src 的副本添加到路径中

source: Add a copy of src to the path, offset by (dx,dy)
zh_cn: 将 src 的副本添加到路径中，偏移(dx，dy)

source: Add a copy of src to the path, transformed by matrix
zh_cn: 将 src 的副本添加到路径中，由矩阵转换

source: Add a cubic bezier from the last point, approaching control points (x1,y1) and (x2,y2), and ending at (x3,y3).
zh_cn: 从最后一点添加一个三次贝塞尔曲线，接近控制点(x1，y1)和(x2，y2)，并以(x3，y3)结束。

source: Add a line from the last point to the specified point (x,y).
zh_cn: 从最后一个点到指定点(x，y)添加一条线。

source: Add a listener that will be called when the offset of this AppBarLayout changes.
zh_cn: 添加将在此 AppBarLayout 的偏移更改时调用的侦听器。

source: Add a listener that will be notified of any changes in scroll state or position.
zh_cn: 添加一个监听器, 作用是当滚动状态 或者 位置发生变化时得到相应的通知。

source: Add a listener that will respond to menu visibility change events.
zh_cn: 添加将响应菜单可见性更改事件的监听器。

source: Add a quadratic bezier from the last point, approaching control point (x1,y1), and ending at (x2,y2).
zh_cn: 从最后一个点添加二次贝塞尔曲线，接近控制点(x1，y1)，并以(x2，y2)结束。

source: Add a view to the currently attached RecyclerView if needed.
zh_cn: 如果需要，添加一个 view 到当前附加的 RecyclerVidew 上。

source: Add an RecyclerView.ItemDecoration to this RecyclerView.
zh_cn: 给该 RecyclerView 添加 RecyclerView.ItemDecoration。

source: Add an RecyclerView.OnItemTouchListener to intercept touch events before they are dispatched to child views or this view's standard scrolling behavior.
zh_cn: 添加一个 RecyclerView.OnItemTouchListener 用于拦截触摸事件，在这些事件被分发给子 view 或该 view 的标准滚动行为之前。

source: Add drawers as child views after the main content view and set the layout_gravity appropriately.
zh_cn: 在主内容 view 后添加抽屉作为子 view，并相应地设置 layout_gravity。

source: Add icons to the start, center, or end of this button using the app:icon, app:iconPadding, app:iconTint, app:iconTintMode and app:iconGravity attributes.
zh_cn: 使用 app:icon，app:iconPadding，app:iconTint，app:iconTintMode 和 app:iconGravity 属性将图标添加到此按钮的开头，中间或末尾。

source: Add it as a child of a ViewPager in your layout file and set its android:layout_gravity to TOP or BOTTOM to pin it to the top or bottom of the ViewPager.
zh_cn: 将它作为 ViewPager 的子项添加到布局文件中，并将其 android:layout_gravity 设置为 TOP 或 BOTTOM，以将其固定到 ViewPager 的顶部或底部。

source: Add the specified arc to the path as a new contour.
zh_cn: 将指定的弧添加到路径中作为新轮廓。

source: Added in API level 10
zh_cn: 添加于 API level 10

source: Added in API level 16
zh_cn: 添加于 API level 16

source: Added in API level 1
zh_cn: 添加于 API level 1

source: Added in API level 23
zh_cn: 添加于 API level 23

source: Additional information about action views is also available in the <Action Bar API guide
zh_cn: 有关操作 view 的其他信息，请参见 <Action Bar API 指南
